In [65]:
import pandas as pd
import matplotlib.pyplot

students_df = pd.read_csv('students_performance.csv')
print(students_df.head(5))

   gender race/ethnicity parental level of education         lunch  \
0  female        group B           bachelor's degree      standard
1  female        group C                some college      standard
2  female        group B             master's degree      standard
3    male        group A          associate's degree  free/reduced
4    male        group C                some college      standard

  test preparation course  math score  reading score  writing score
0                    none          72             72             74
1               completed          69             90             88
2                    none          90             95             93
3                    none          47             57             44
4                    none          76             78             75

In [66]:
 #info block
end_str = '\n' + '=' * 50 + '\n'

print(students_df.info(), end=end_str)

#строки столбцы
print(students_df.shape, end=end_str)
print(students_df.describe(include='all'))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1002 entries, 0 to 1001
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1002 non-null   object
 1   race/ethnicity               1002 non-null   object
 2   parental level of education  1002 non-null   object
 3   lunch                        1002 non-null   object
 4   test preparation course      1002 non-null   object
 5   math score                   1002 non-null   int64
 6   reading score                1002 non-null   int64
 7   writing score                1002 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.8+ KB
None
==================================================
(1002, 8)
==================================================
        gender race/ethnicity parental level of education     lunch  \
count     1002           1002                        1002      1002
unique       2              5                           6         2
top     female        group C                some college  standard
freq       519            319                         227       647
mean       NaN            NaN                         NaN       NaN
std        NaN            NaN                         NaN       NaN
min        NaN            NaN                         NaN       NaN
25%        NaN            NaN                         NaN       NaN
50%        NaN            NaN                         NaN       NaN
75%        NaN            NaN                         NaN       NaN
max        NaN            NaN                         NaN       NaN

       test preparation course   math score  reading score  writing score
count                     1002  1002.000000    1002.000000    1002.000000
unique                       2          NaN            NaN            NaN
top                       none          NaN            NaN            NaN
freq                       644          NaN            NaN            NaN
mean                       NaN    66.075848      69.137725      68.030938
std                        NaN    15.156731      14.602389      15.189382
min                        NaN     0.000000      17.000000      10.000000
25%                        NaN    57.000000      59.000000      57.250000
50%                        NaN    66.000000      70.000000      69.000000
75%                        NaN    77.000000      79.000000      79.000000
max                        NaN   100.000000     100.000000     100.000000

In [67]:
#работа с столбцами переименовать в стиль питона
col = students_df.columns
col = col.str.replace(' ', '_').str.lower()
students_df.columns = col
students_df

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
997,female,group E,master's degree,standard,completed,88,99,95
998,male,group C,high school,free/reduced,none,62,55,55
999,female,group C,high school,free/reduced,completed,59,71,65
1000,female,group D,some college,standard,completed,68,78,77
1001,female,group D,some college,free/reduced,none,77,86,86

In [68]:
students_df

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
997,female,group E,master's degree,standard,completed,88,99,95
998,male,group C,high school,free/reduced,none,62,55,55
999,female,group C,high school,free/reduced,completed,59,71,65
1000,female,group D,some college,standard,completed,68,78,77
1001,female,group D,some college,free/reduced,none,77,86,86

In [69]:
#чистка от дубликатов и пропусков
print(students_df.duplicated().sum())
print(students_df[students_df.duplicated()])
# print(students_df.isna().sum())

2
    gender race/ethnicity parental_level_of_education     lunch  \
15  female        group A             master's degree  standard
28    male        group B                some college  standard

   test_preparation_course  math_score  reading_score  writing_score
15                    none          50             53             58
28                    none          69             54             55

In [75]:
mask = students_df.reading_score == 100
students_df[mask]

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
108,female,group D,master's degree,standard,none,87,100,100
116,female,group E,bachelor's degree,standard,completed,99,100,100
151,male,group E,associate's degree,free/reduced,completed,100,100,93
167,female,group C,bachelor's degree,standard,completed,96,100,100
181,female,group D,some high school,standard,completed,97,100,100
383,male,group C,associate's degree,standard,completed,87,100,95
460,female,group E,bachelor's degree,standard,none,100,100,100
548,female,group A,some high school,standard,completed,92,100,97
568,female,group E,bachelor's degree,free/reduced,completed,92,100,100
596,female,group C,bachelor's degree,standard,completed,92,100,99
714,female,group D,some college,standard,none,98,100,99
888,female,group E,associate's degree,standard,completed,93,100,95
905,female,group D,bachelor's degree,free/reduced,completed,93,100,100
918,male,group E,bachelor's degree,standard,completed,100,100,100
959,female,group D,master's degree,standard,none,92,100,100
964,female,group E,associate's degree,standard,none,100,100,100
972,female,group D,bachelor's degree,standard,none,89,100,100

In [63]:
students_df = students_df.drop_duplicates()
print(students_df.duplicated().sum())

0